БылковД.А_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ТекущийСтатусЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
</mdclass:Document>

БылковД.А_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ/ObjectModule.bsl
&НаСервере
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей") Тогда
				Дисциплина = ДанныеЗаполнения.Дисциплина;
		Преподаватель = ДанныеЗаполнения.Преподаватель;
		Студент = ДанныеЗаполнения.Студент;
		
	 // Получаем наименование контроля для данной дисциплины
        НаименованиеКонтроля = Неопределено;
        
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |	Дисциплины.НаименованиеКонтроля КАК НаименованиеКонтроля
        |ИЗ
        |	Справочник.Дисциплины КАК Дисциплины
        |ГДЕ
        |	Дисциплины.Ссылка = &Дисциплина
        |	И НЕ Дисциплины.ЭтоГруппа";
        
        Запрос.УстановитьПараметр("Дисциплина", ЭтотОбъект.Дисциплина);
        Результат = Запрос.Выполнить();
        
        Если Не Результат.Пустой() Тогда
            Выборка = Результат.Выбрать();
            Если Выборка.Следующий() Тогда
                НаименованиеКонтроля = Выборка.НаименованиеКонтроля;
            КонецЕсли;
        КонецЕсли;
        
        // Заполняем наименование контроля в шапке
        Если ЗначениеЗаполнено(НаименованиеКонтроля) Тогда
            ЭтотОбъект.НаименованиеКонтроля = НаименованиеКонтроля;
        КонецЕсли;
     КонецЕсли;

	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ТекущийСтатусЗадолженностей
	Движения.ТекущийСтатусЗадолженностей.Записывать = Истина;
	Движение = Движения.ТекущийСтатусЗадолженностей.Добавить();
	Движение.Студент = Студент;
	Движение.Дисциплина = Дисциплина;
	Движение.СтатусЗадолженности = СтатусАкадемическойЗадолженности;

	// регистр ОценкиСтудентов
	Движения.ОценкиСтудентов.Записывать = Истина;
	Движение = Движения.ОценкиСтудентов.Добавить();
	Движение.Период = Дата;
	Движение.Студент = Студент;
	Движение.Дисциплина = Дисциплина;
	Движение.ВидКонтроля = НаименованиеКонтроля;
	Движение.Преподаватель = Преподаватель;
	Движение.Оценка = Оценка;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
